<?xml version="1.0"?>
<net name="human-pose-estimation-0001" version="11">
	<layers>
		<layer id="0" name="data" type="Parameter" version="opset1">
			<data shape="1,3,256,456" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="data">
					<dim>1</dim>
					<dim>3</dim>
					<dim>256</dim>
					<dim>456</dim>
					<rt_info>
						<attribute name="layout" version="0" layout="[N,C,H,W]" />
					</rt_info>
				</port>
			</output>
		</layer>
		<layer id="1" name="Constant_582" type="Const" version="opset1">
			<data element_type="f32" shape="1, 3, 1, 1" offset="0" size="12" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="Subtract_583" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="preprocessing" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>256</dim>
					<dim>456</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>256</dim>
					<dim>456</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="Constant_1600" type="Const" version="opset1">
			<data element_type="f32" shape="32, 3, 3, 3" offset="12" size="3456" />
			<rt_info>
				<attribute name="preprocessing" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="conv1" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<rt_info>
				<attribute name="preprocessing" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>256</dim>
					<dim>456</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>128</dim>
					<dim>228</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="data_add_8879" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="3468" size="128" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="conv1/bn/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>128</dim>
					<dim>228</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="conv1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>128</dim>
					<dim>228</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="relu1" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>128</dim>
					<dim>228</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="conv1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>128</dim>
					<dim>228</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="conv2_1/dw/bn/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="32, 1, 1, 3, 3" offset="3596" size="1152" />
			<output>
				<port id="0" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="conv2_1/dw" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>128</dim>
					<dim>228</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>128</dim>
					<dim>228</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="data_add_88828887" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="4748" size="128" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="conv2_1/dw/bn/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>128</dim>
					<dim>228</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="conv2_1/dw">
					<dim>1</dim>
					<dim>32</dim>
					<dim>128</dim>
					<dim>228</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="relu2_1/dw" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>128</dim>
					<dim>228</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="conv2_1/dw">
					<dim>1</dim>
					<dim>32</dim>
					<dim>128</dim>
					<dim>228</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="conv2_1/sep/bn/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="64, 32, 1, 1" offset="4876" size="8192" />
			<output>
				<port id="0" precision="FP32">
					<dim>64</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="conv2_1/sep" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>128</dim>
					<dim>228</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>128</dim>
					<dim>228</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="data_add_88908895" type="Const" version="opset1">
			<data element_type="f32" shape="1, 64, 1, 1" offset="13068" size="256" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="conv2_1/sep/bn/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>128</dim>
					<dim>228</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="conv2_1/sep">
					<dim>1</dim>
					<dim>64</dim>
					<dim>128</dim>
					<dim>228</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="relu2_1/sep" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>128</dim>
					<dim>228</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="conv2_1/sep">
					<dim>1</dim>
					<dim>64</dim>
					<dim>128</dim>
					<dim>228</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="conv2_2/dw/bn/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="64, 1, 1, 3, 3" offset="13324" size="2304" />
			<output>
				<port id="0" precision="FP32">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="conv2_2/dw" type="GroupConvolution" version="opset1">
			<data strides="2, 2" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>128</dim>
					<dim>228</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>64</dim>
					<dim>114</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="data_add_88988903" type="Const" version="opset1">
			<data element_type="f32" shape="1, 64, 1, 1" offset="15628" size="256" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="conv2_2/dw/bn/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>64</dim>
					<dim>114</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="conv2_2/dw">
					<dim>1</dim>
					<dim>64</dim>
					<dim>64</dim>
					<dim>114</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="relu2_2/dw" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>64</dim>
					<dim>114</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="conv2_2/dw">
					<dim>1</dim>
					<dim>64</dim>
					<dim>64</dim>
					<dim>114</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="conv2_2/sep/bn/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="128, 64, 1, 1" offset="15884" size="32768" />
			<output>
				<port id="0" precision="FP32">
					<dim>128</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="conv2_2/sep" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>64</dim>
					<dim>114</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>114</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="data_add_89068911" type="Const" version="opset1">
			<data element_type="f32" shape="1, 128, 1, 1" offset="48652" size="512" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="conv2_2/sep/bn/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>114</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="conv2_2/sep">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>114</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="relu2_2/sep" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>114</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="conv2_2/sep">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>114</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="conv3_1/dw/bn/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="128, 1, 1, 3, 3" offset="49164" size="4608" />
			<output>
				<port id="0" precision="FP32">
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="conv3_1/dw" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>114</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>114</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="data_add_89148919" type="Const" version="opset1">
			<data element_type="f32" shape="1, 128, 1, 1" offset="53772" size="512" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="conv3_1/dw/bn/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>114</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="conv3_1/dw">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>114</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="relu3_1/dw" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>114</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="conv3_1/dw">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>114</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="conv3_1/sep/bn/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="128, 128, 1, 1" offset="54284" size="65536" />
			<output>
				<port id="0" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="conv3_1/sep" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>114</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>114</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="data_add_89228927" type="Const" version="opset1">
			<data element_type="f32" shape="1, 128, 1, 1" offset="119820" size="512" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="conv3_1/sep/bn/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>114</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="conv3_1/sep">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>114</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="relu3_1/sep" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>114</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="conv3_1/sep">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>114</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="conv3_2/dw/bn/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="128, 1, 1, 3, 3" offset="120332" size="4608" />
			<output>
				<port id="0" precision="FP32">
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="conv3_2/dw" type="GroupConvolution" version="opset1">
			<data strides="2, 2" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>114</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>57</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="data_add_89308935" type="Const" version="opset1">
			<data element_type="f32" shape="1, 128, 1, 1" offset="124940" size="512" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="conv3_2/dw/bn/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>57</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="conv3_2/dw">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>57</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="relu3_2/dw" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>57</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="conv3_2/dw">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>57</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="conv3_2/sep/bn/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="256, 128, 1, 1" offset="125452" size="131072" />
			<output>
				<port id="0" precision="FP32">
					<dim>256</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="conv3_2/sep" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>57</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>32</dim>
					<dim>57</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="data_add_89388943" type="Const" version="opset1">
			<data element_type="f32" shape="1, 256, 1, 1" offset="256524" size="1024" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="conv3_2/sep/bn/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>32</dim>
					<dim>57</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="conv3_2/sep">
					<dim>1</dim>
					<dim>256</dim>
					<dim>32</dim>
					<dim>57</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="relu3_2/sep" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>32</dim>
					<dim>57</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="conv3_2/sep">
					<dim>1</dim>
					<dim>256</dim>
					<dim>32</dim>
					<dim>57</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="conv4_1/dw/bn/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="256, 1, 1, 3, 3" offset="257548" size="9216" />
			<output>
				<port id="0" precision="FP32">
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="conv4_1/dw" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>32</dim>
					<dim>57</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>32</dim>
					<dim>57</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="data_add_89468951" type="Const" version="opset1">
			<data element_type="f32" shape="1, 256, 1, 1" offset="266764" size="1024" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="conv4_1/dw/bn/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>32</dim>
					<dim>57</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="conv4_1/dw">
					<dim>1</dim>
					<dim>256</dim>
					<dim>32</dim>
					<dim>57</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="relu4_1/dw" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>32</dim>
					<dim>57</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="conv4_1/dw">
					<dim>1</dim>
					<dim>256</dim>
					<dim>32</dim>
					<dim>57</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="conv4_1/sep/bn/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="256, 256, 1, 1" offset="267788" size="262144" />
			<output>
				<port id="0" precision="FP32">
					<dim>256</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="conv4_1/sep" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>32</dim>
					<dim>57</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>32</dim>
					<dim>57</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="data_add_89548959" type="Const" version="opset1">
			<data element_type="f32" shape="1, 256, 1, 1" offset="529932" size="1024" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="conv4_1/sep/bn/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>32</dim>
					<dim>57</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="conv4_1/sep">
					<dim>1</dim>
					<dim>256</dim>
					<dim>32</dim>
					<dim>57</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="relu4_1/sep" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>32</dim>
					<dim>57</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="conv4_1/sep">
					<dim>1</dim>
					<dim>256</dim>
					<dim>32</dim>
					<dim>57</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="conv4_2/dw/bn/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="256, 1, 1, 3, 3" offset="530956" size="9216" />
			<output>
				<port id="0" precision="FP32">
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="conv4_2/dw" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>32</dim>
					<dim>57</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>32</dim>
					<dim>57</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="data_add_89628967" type="Const" version="opset1">
			<data element_type="f32" shape="1, 256, 1, 1" offset="540172" size="1024" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="conv4_2/dw/bn/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>32</dim>
					<dim>57</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="conv4_2/dw">
					<dim>1</dim>
					<dim>256</dim>
					<dim>32</dim>
					<dim>57</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="relu4_2/dw" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>32</dim>
					<dim>57</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="conv4_2/dw">
					<dim>1</dim>
					<dim>256</dim>
					<dim>32</dim>
					<dim>57</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="conv4_2/sep/bn/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="512, 256, 1, 1" offset="541196" size="524288" />
			<output>
				<port id="0" precision="FP32">
					<dim>512</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="conv4_2/sep" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>32</dim>
					<dim>57</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>512</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>32</dim>
					<dim>57</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="data_add_89708975" type="Const" version="opset1">
			<data element_type="f32" shape="1, 512, 1, 1" offset="1065484" size="2048" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="conv4_2/sep/bn/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>32</dim>
					<dim>57</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="conv4_2/sep">
					<dim>1</dim>
					<dim>512</dim>
					<dim>32</dim>
					<dim>57</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="relu4_2/sep" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>32</dim>
					<dim>57</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="conv4_2/sep">
					<dim>1</dim>
					<dim>512</dim>
					<dim>32</dim>
					<dim>57</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="conv5_1/dw/bn/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="512, 1, 1, 3, 3" offset="1067532" size="18432" />
			<output>
				<port id="0" precision="FP32">
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="conv5_1/dw" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="2, 2" pads_end="2, 2" dilations="2, 2" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>32</dim>
					<dim>57</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>32</dim>
					<dim>57</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="data_add_89788983" type="Const" version="opset1">
			<data element_type="f32" shape="1, 512, 1, 1" offset="1085964" size="2048" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="conv5_1/dw/bn/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>32</dim>
					<dim>57</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="conv5_1/dw">
					<dim>1</dim>
					<dim>512</dim>
					<dim>32</dim>
					<dim>57</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="relu5_1/dw" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>32</dim>
					<dim>57</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="conv5_1/dw">
					<dim>1</dim>
					<dim>512</dim>
					<dim>32</dim>
					<dim>57</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="conv5_1/sep/bn/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="512, 512, 1, 1" offset="1088012" size="1048576" />
			<output>
				<port id="0" precision="FP32">
					<dim>512</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="conv5_1/sep" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>32</dim>
					<dim>57</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>512</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>32</dim>
					<dim>57</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="data_add_89868991" type="Const" version="opset1">
			<data element_type="f32" shape="1, 512, 1, 1" offset="2136588" size="2048" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="conv5_1/sep/bn/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>32</dim>
					<dim>57</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="conv5_1/sep">
					<dim>1</dim>
					<dim>512</dim>
					<dim>32</dim>
					<dim>57</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="relu5_1/sep" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>32</dim>
					<dim>57</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="conv5_1/sep">
					<dim>1</dim>
					<dim>512</dim>
					<dim>32</dim>
					<dim>57</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="conv5_2/dw/bn/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="512, 1, 1, 3, 3" offset="2138636" size="18432" />
			<output>
				<port id="0" precision="FP32">
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="conv5_2/dw" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>32</dim>
					<dim>57</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>32</dim>
					<dim>57</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="data_add_89948999" type="Const" version="opset1">
			<data element_type="f32" shape="1, 512, 1, 1" offset="2157068" size="2048" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="conv5_2/dw/bn/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>32</dim>
					<dim>57</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="conv5_2/dw">
					<dim>1</dim>
					<dim>512</dim>
					<dim>32</dim>
					<dim>57</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="relu5_2/dw" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>32</dim>
					<dim>57</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="conv5_2/dw">
					<dim>1</dim>
					<dim>512</dim>
					<dim>32</dim>
					<dim>57</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="conv5_2/sep/bn/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="512, 512, 1, 1" offset="2159116" size="1048576" />
			<output>
				<port id="0" precision="FP32">
					<dim>512</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="conv5_2/sep" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>32</dim>
					<dim>57</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>512</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>32</dim>
					<dim>57</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="data_add_90029007" type="Const" version="opset1">
			<data element_type="f32" shape="1, 512, 1, 1" offset="3207692" size="2048" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="conv5_2/sep/bn/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>32</dim>
					<dim>57</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="conv5_2/sep">
					<dim>1</dim>
					<dim>512</dim>
					<dim>32</dim>
					<dim>57</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="relu5_2/sep" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>32</dim>
					<dim>57</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="conv5_2/sep">
					<dim>1</dim>
					<dim>512</dim>
					<dim>32</dim>
					<dim>57</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="conv5_3/dw/bn/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="512, 1, 1, 3, 3" offset="3209740" size="18432" />
			<output>
				<port id="0" precision="FP32">
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="conv5_3/dw" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>32</dim>
					<dim>57</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>32</dim>
					<dim>57</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="data_add_90109015" type="Const" version="opset1">
			<data element_type="f32" shape="1, 512, 1, 1" offset="3228172" size="2048" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="conv5_3/dw/bn/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>32</dim>
					<dim>57</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="conv5_3/dw">
					<dim>1</dim>
					<dim>512</dim>
					<dim>32</dim>
					<dim>57</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="relu5_3/dw" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>32</dim>
					<dim>57</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="conv5_3/dw">
					<dim>1</dim>
					<dim>512</dim>
					<dim>32</dim>
					<dim>57</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="conv5_3/sep/bn/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="512, 512, 1, 1" offset="3230220" size="1048576" />
			<output>
				<port id="0" precision="FP32">
					<dim>512</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="conv5_3/sep" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>32</dim>
					<dim>57</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>512</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>32</dim>
					<dim>57</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="data_add_90189023" type="Const" version="opset1">
			<data element_type="f32" shape="1, 512, 1, 1" offset="4278796" size="2048" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="conv5_3/sep/bn/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>32</dim>
					<dim>57</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="conv5_3/sep">
					<dim>1</dim>
					<dim>512</dim>
					<dim>32</dim>
					<dim>57</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="relu5_3/sep" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>32</dim>
					<dim>57</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="conv5_3/sep">
					<dim>1</dim>
					<dim>512</dim>
					<dim>32</dim>
					<dim>57</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="conv5_4/dw/bn/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="512, 1, 1, 3, 3" offset="4280844" size="18432" />
			<output>
				<port id="0" precision="FP32">
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="conv5_4/dw" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>32</dim>
					<dim>57</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>32</dim>
					<dim>57</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="data_add_90269031" type="Const" version="opset1">
			<data element_type="f32" shape="1, 512, 1, 1" offset="4299276" size="2048" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="conv5_4/dw/bn/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>32</dim>
					<dim>57</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="conv5_4/dw">
					<dim>1</dim>
					<dim>512</dim>
					<dim>32</dim>
					<dim>57</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="relu5_4/dw" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>32</dim>
					<dim>57</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="conv5_4/dw">
					<dim>1</dim>
					<dim>512</dim>
					<dim>32</dim>
					<dim>57</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="conv5_4/sep/bn/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="512, 512, 1, 1" offset="4301324" size="1048576" />
			<output>
				<port id="0" precision="FP32">
					<dim>512</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="conv5_4/sep" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>32</dim>
					<dim>57</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>512</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>32</dim>
					<dim>57</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="data_add_90349039" type="Const" version="opset1">
			<data element_type="f32" shape="1, 512, 1, 1" offset="5349900" size="2048" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="conv5_4/sep/bn/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>32</dim>
					<dim>57</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="conv5_4/sep">
					<dim>1</dim>
					<dim>512</dim>
					<dim>32</dim>
					<dim>57</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="relu5_4/sep" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>32</dim>
					<dim>57</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="conv5_4/sep">
					<dim>1</dim>
					<dim>512</dim>
					<dim>32</dim>
					<dim>57</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="conv5_5/dw/bn/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="512, 1, 1, 3, 3" offset="5351948" size="18432" />
			<output>
				<port id="0" precision="FP32">
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="conv5_5/dw" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>32</dim>
					<dim>57</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>32</dim>
					<dim>57</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="data_add_90429047" type="Const" version="opset1">
			<data element_type="f32" shape="1, 512, 1, 1" offset="5370380" size="2048" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="conv5_5/dw/bn/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>32</dim>
					<dim>57</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="conv5_5/dw">
					<dim>1</dim>
					<dim>512</dim>
					<dim>32</dim>
					<dim>57</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="relu5_5/dw" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
